## Досрок 2-й вариант

**27**  
Метеорологическая станция ежеминутно снимали показания прибора в течение N минут (N – целое число), которое измеряет количество осадков в условных единицах за минуту, предшествующую снятию показаний. Необходимо найти максимальную сумму двух показаний, между которыми прошло не менее K минут.

<a href="/dosrok/2/27_A.txt" download>Файл A</a>

<a href="/dosrok/2/27_B.txt" download>Файл B</a>

Даны два входных файла, каждый из которых в первой строке содержит число K — минимальное время, которое должно пройти мужду двумя снятиями показаний. Во второй строке число N (1 ≤ N ≤ 10 000 000, N > K) — количество измерений показателя. В каждой из следующих N строк находятся одно число: количество осадков (все числа неотрицательные, не превышающие 10 000 000). Числа указаны в порядке снятия показаний прибора, начиная с первой минуты.

```python
f = open('27_B.txt')
k = int(f.readline())
n = int(f.readline())
array = []
maxPair = 0
left = 0
for i in range(n):
    array.append(int(f.readline()))
    if i > k:
        left = max(left, array[i - k - 1])
        maxPair = max(maxPair, array[i] + left)
print(maxPair)
```
