## Решу ЕГЭ 14-й вариант

**27**  
Дана последовательность N целых положительных чисел. Рассматриваются все пары элементов последовательности, разность которых чётна, и в этих парах, по крайней мере, одно из чисел пары делится на 17. Порядок элементов в паре неважен. Среди всех таких пар нужно найти и вывести пару с максимальной суммой элементов. Если одинаковую максимальную сумму имеет несколько пар, можно вывести любую из них. Если подходящих пар в последовательности нет, нужно вывести два нуля.

<a href="/reshuege/14/27_A.txt" download>Файл A</a>

<a href="/reshuege/14/27_B.txt" download>Файл B</a>

В первой строке входных данных задаётся количество чисел N (2 ≤ N ≤ 10 000). В каждой из последующих N строк записано одно натуральное число, не превышающее 10 000.

В ответе укажите четыре числа: сначала значение искомой пары для файла А (два числа через пробел), затем для файла B (два числа через пробел). Числа пар впишите в порядке убывания.

```python
f = open('27_B.txt')
n = int(f.readline())
odd = even = odd_17 = even_17 = odd_17_2 = even_17_2 = 0
for i in range(n):
    num = int(f.readline())
    if num % 34 == 0:
        if num >= even_17:
            even_17_2 = even_17
            even_17 = num
    elif num % 17 == 0:
        if num >= odd_17:
            odd_17_2 = odd_17
            odd_17 = num
    elif num % 2 == 0:
        even = max(even, num)
    else:
        odd = max(odd, num)
print(sorted(max([even_17, even_17_2], [even_17, even], [odd_17, odd_17_2], [odd_17, odd], key=lambda x: x[0] + x[1]), reverse=True))
```
