## Пробник 3 мая 1-й вариант

**27**  
Дана последовательность натуральных чисел. Расстояние между элементами последовательности – это разность их порядковых номеров. Например, если два элемента стоят в последовательности рядом, расстояние между ними равно 1, если два элемента стоят через один – расстояние равно 2 и т. д.

Назовём тройкой любые три числа из последовательности, расстояние между которыми не меньше 17. Необходимо определить количество троек, в которых сумма чисел в тройке делится без остатка на 7717.

<a href="/probnik/1/27_A.txt" download>Файл A</a>

<a href="/probnik/1/27_B.txt" download>Файл B</a>

В первой строке входных данных задаётся количество чисел N. В каждой из последующих N строк записано одно натуральное число.

```python
f = open('27_B.txt')
n = int(f.readline())
array = [int(x) for x in f]
remainders = [0] * 7717
pairs = [0] * 7717
count = 0
for i in range(34, n):
    remainders[array[i - 34] % 7717] += 1
    for j in range(7717):
        pairs[(j + array[i - 17]) % 7717] += remainders[j]
    count += pairs[(7717 - array[i] % 7717) % 7717]
print(count)
```
