## Решу ЕГЭ 5-й вариант

**27**  
У медицинской компании есть N пунктов приёма биоматериалов на анализ. Все пункты расположены вдоль автомагистрали и имеют номера, соответствующие расстоянию от нулевой отметки до конкретного пункта. Известно количество пробирок, которое ежедневно принимают в каждом из пунктов. Пробирки перевозят в специальных транспортировочных контейнерах вместимостью не более 36 штук. Каждый транспортировочный контейнер упаковывается в пункте приёма и вскрывается только в лаборатории.

Стоимость перевозки биоматериалов равна произведению расстояния от пункта до лаборатории на количество контейнеров с пробирками. Общая стоимость перевозки за день равна сумме стоимостей перевозок из каждого пункта в лабораторию. Лабораторию расположили в одном из пунктов приёма биоматериалов таким образом, что общая стоимость доставки биоматериалов из всех пунктов минимальна.

Определите минимальную общую стоимость доставки биоматериалов из всех пунктов приёма в лабораторию.

<a href="/reshuege/5/27_A.txt" download>Файл A</a> 

<a href="/reshuege/5/27_B.txt" download>Файл B</a> 

Дано два входных файла (файл A и файл B), каждый из которых в первой строке содержит число N (1 ≤ N ≤ 10 000 000)  — количество пунктов приёма биоматериалов. В каждой из следующих N строк находится два числа: номер пункта и количество пробирок в этом пункте (все числа натуральные, количество пробирок в каждом пункте не превышает 1000). Пункты перечислены в порядке их расположения вдоль дороги, начиная от нулевой отметки.

```python
f = open('27_B.txt')
n = int(f.readline())
a = []
for i in range(n):
    number, tube = map(int, f.readline().split())
    if tube % 36 == 0:
        container = tube // 36
    else:
        container = tube // 36 + 1
    a.append([number, container])

prefixsum = [0]*n
prefixsum[0] = a[0][1]
for i in range(1, n):
    prefixsum[i] = prefixsum[i-1] + a[i][1]

s = 0
for i in range(n):
    s += abs(a[0][0] - a[i][0]) * a[i][1]
minsum = s

for i in range(1, n):
    diff = a[i][0] - a[i-1][0]
    s = s + diff * prefixsum[i-1] - diff*(prefixsum[n-1] - prefixsum[i-1])
    minsum = min(minsum, s)
print(minsum)
```
