## Решу ЕГЭ 12-й вариант

**27**  
На вход программы поступает последовательность из N целых положительных чисел. Рассматриваются все пары различных элементов последовательности (элементы пары не обязаны стоять в последовательности рядом, порядок элементов в паре неважен). Необходимо определить количество пар, для которых произведение элементов кратно 62.

<a href="/reshuege/12/27_A.txt" download>Файл A</a>

<a href="/reshuege/12/27_B.txt" download>Файл B</a>

В первой строке входных данных задаётся количество чисел N (1 ≤ N ≤ 60 000). В каждой из последующих N строк записано одно натуральное число, не превышающее 10 000. В качестве результата программа должна вывести одно число: количество пар, в которых произведение элементов кратно 62.

```python
f = open('27_B.txt')
n = int(f.readline())
a = []
dict = {1:0, 2:0, 31:0, 62:0}
for i in range(n):
    num = int(f.readline())
    a.append(num)
    if num % 62 == 0:
        dict[62] += 1
    elif num % 31 == 0:
        dict[31] += 1
    elif num % 2 == 0:
        dict[2] += 1
    else:
        dict[1] += 1
ans = dict[1] * dict[62] + dict[2] * (dict[31] + dict[62]) + dict[31] * dict[62] + (dict[62] * (dict[62] - 1) / 2)
print(ans)
```
