## Решу ЕГЭ 3-й вариант

17.   В файле содержится последовательность из 10 000 целых положительных чисел. Каждое число не превышает 10 000. Определите и запишите в ответе сначала количество пар элементов последовательности, у которых сумма нечётна, а произведение делится на 5, затем максимальную из сумм элементов таких пар. В данной задаче под парой подразумевается два различных элемента последовательности. Порядок элементов в паре не важен.

      <a href="/reshuege/3/17.txt" download>Файл</a> к заданию

      ```python
      f = open('17.txt')
      a = [int(x) for x in f]
      five = [x for x in a if x%10==5]
      ten = [x for x in a if x%10==0]
      odd = [x for x in a if x%2!=0]
      even = [x for x in a if x%2==0]
      num = len(five)*len(even)+len(ten)*len(odd) - len(ten)*len(five)
      mf = max(five) + max(even)
      mt = max(ten) + max(odd)

      print(num, max(mf,mt))
      ```

